#!/usr/bin/python3

import uuid
import torndb
import random


# 用于批量生成数据库数据的工具
# c_WS_ID
b_DQ = ['广东省广州市XX区人民法院', '河南省南阳市XX区人民法院', '江苏省镇江市XX人民法院', '湖北省武汉市XX区人民法院', '四川省成都市XXX人民法院']
b_YG = ['张文秀', '刘婷婷', '巩立姣', '王峥', '李玲蔚', '吕秀芝', '韦永丽', '王春雨', '李玲', '切阳什姐', '吕会会', '袁琦琦', '林慧君', '任梦茜', '吴水娇', '岳超', '刘诗颖', '高阳', '李小红', '孔令微', '卞卡', '苏欣悦', '陈扬', '冯彬', '梁小静', '葛曼棋', '张新艳', '华绍青', '刘虹', '蔡泽林', '张国伟', '谢文骏', '董斌', '苏炳添', '张培萌', '王镇', '陈定']
b_BG = ['傅园慧', '陆滢', '唐奕', '陈洁', '陈欣怡', '史婧琳', '叶诗文', '王施佳', '辛鑫', '董洁', '沈铎', '曹玥', '周羿霖', '孙美晨', '周敏', '刘湘', '朱梦惠', '张馨予', '张雨霏', '张雨涵', '汪雪儿', '艾衍含', '柳雅欣', '侯雅雯', '于静瑶', '唐雨婷', '祖立军', '何健彬', '孙杨', '汪顺', '徐嘉余', '张麒斌', '毛飞廉', '林永庆', '宁泽涛', '李响', '商科元']
b_YGDLR = ['董国建', '王宇', '曹硕', '谢震业', '薛长锐', '莫有雪', '王振东', '王嘉男', '黄常洲', '杨洋', '高兴龙', '多布杰', '汤星强', '黄博凯', '姚捷', '徐晓龙', '韩玉成', '于伟', '朱仁学', '唐功臣', '王凯华', '张航']
b_BGDLR = ['余贺新', '李朱濠', '李广源', '邱子傲', '闫子贝', '吴宇航', '胡逸轩', '刘兆尘']
b_SPY = ['陈晓佳', '李珊珊', '露雯', ' 高颂', '陈楠', ' 黄红玭', '孙梦然', '邵婷', '孙梦昕', '赵志芳', '吴迪', '黄思静' ]
b_SPZ = ['易建联', '周鹏', '郭艾伦', '王哲林', '翟晓川', '睢冉', '李慕豪', '丁彦雨航', '李根', '赵继伟', '周琦', '邹雨宸' ]
b_PSY = ['赵敬楠', '尚蓉', '张玲', '鲍语晴', '杨晔', '舒思瑶' ]
b_SJY = ['杨珺', ' 孙雅婷', '宋冬伦', ' 马欢欢', '张潀', '张薇薇', '彭林', '王歆艳', '赵子涵', '梅笑寒', '熊敦瀚', '张婧', '牛冠男']

b_CPRQ = ["2007-10-10 23:40:00", "2008-10-10 23:40:00", "2009-3-10 23:40:00", "2010-5-10 23:40:00", "2011-1-10 23:40:00", "2012-7-10 23:40:00", "2013-10-10 23:40:00", "2014-12-10 23:40:00", "2015-1-10 23:40:00", "2016-12-10 23:40:00"]
# b_AJMC 纠纷民事判决书
# c_SPCX 一审
# c_AH = 初字第153号
b_FYMC = ['广州市XX区人民法院', '南阳市XX区人民法院', '镇江市XX人民法院', '武汉市XX区人民法院', '成都市XXX人民法院']

b_DQ_S = ['广东', '河南', '江苏', '湖北', '四川']

db_conn = torndb.Connection("192.168.1.233", "v5_law", "v5kf", "v5kf")

for i in range(6, 10001):
    rd = random.randint(1,1000)
    uuid_s = str(uuid.uuid4())
    SQL = "INSERT INTO `v5_law_meta` VALUES (%d,'%s','%s','%s','%s','%s','%s','%s','%s','%s','%s','%s','%s','一审','%s','%s');" %(i, uuid_s, b_DQ[rd%len(b_DQ)], b_YG[rd%len(b_YG)], b_YGDLR[rd%len(b_YGDLR)], b_BG[rd%len(b_BG)], b_BGDLR[rd%len(b_BGDLR)], b_SPY[rd%len(b_SPY)], b_SPZ[rd%len(b_SPZ)], b_PSY[rd%len(b_PSY)], b_SJY[rd%len(b_SJY)], b_CPRQ[rd%len(b_CPRQ)], b_YG[rd%len(b_YG)]+'与'+b_BG[rd%len(b_BG)]+'民间借贷纠纷一案一审民事判决书', '（'+b_CPRQ[rd%len(b_CPRQ)][:4]+'）'+b_FYMC[rd%len(b_FYMC)]+'民初字第XXX号',b_FYMC[rd%len(b_FYMC)])
    db_conn.execute(SQL)
    
    SQL = "INSERT INTO `v5_law_text` VALUES (%d,'%s','%s','%s','%s','%s','%s','%s','%s','%s','%s','%s','%s');" % (i, uuid_s, "【文书全文】", "【案件程序】", "【原告诉称】", "【原告请求判令】", "【原告举证】", "【被告辩称】", "【法院采信证据】", "【法院查明事实】", "【法院审理意见】", "【法院判决】", "【上诉指引】")
    db_conn.execute(SQL)

    SQL = "INSERT INTO `v5_law_info` VALUES (%d,'%s','%s')" %(i, uuid_s, b_DQ[rd%len(b_DQ)][:2])
    db_conn.execute(SQL)

print("HELLO WORLD!")


